Repository: muh-dirga-f/multivendor_cscart
Catalog: var/langs/*/addons/master_products.po
Languages: he_il, hu_hu, ja_jp, pl_pl, ru_ru

# Addons::name::master_products
source: Common Products for Vendors
he_il: מוצרים נפוצים עבור ספקים
hu_hu: Közös termékek az eladók számára
ja_jp: 出品者向けの共通商品
pl_pl: Wspólne produkty dla sprzedawców
ru_ru: Общие товары для продавцов

# Addons::description::master_products
source: Allows you to create a single product base: vendors choose which of the existing products they sell.
he_il: מאפשר לך ליצור בסיס מוצר אחד: ספקים לבחור איזה מהמוצרים הקיימים הם מוכרים.
hu_hu: Lehetővé teszi egységes termékbázis létrehozását: az eladók választhatják ki, hogy a meglévő termékek közül melyiket értékesítik.
ja_jp: 運営者が商品のベースを作成し、出品者はその中から売りたい商品を選択して販売します。
pl_pl: Umożliwia utworzenie pojedynczej bazy produktów: sprzedawcy wybierają, które z istniejących produktów sprzedają.
ru_ru: Позволяет вам создать единую базу товаров: продавцы будут выбирать, какие из существующих в базе товаров они продают.

# SettingsSections::master_products::general
source: General
he_il: כללי
hu_hu: Általános
ja_jp: 基本設定
pl_pl: Ogólne
ru_ru: Общие

# SettingsOptions::master_products::allow_vendors_to_create_products
source: Allow vendors to create products
he_il: מאפשר לספקים ליצור מוצרים
hu_hu: Az eladók termékeket hozhatnak létre
ja_jp: 出品者の商品追加を許可
pl_pl: Pozwól sprzedawcom tworzyć produkty
ru_ru: Разрешить продавцам создавать товары

# SettingsTooltips::master_products::allow_vendors_to_create_products
source: If you don't allow it, vendors will only be able to sell the products that you added to the marketplace.
he_il: אם לא תאפשר זאת, הספקים יוכלו למכור רק את המוצרים שהוספת לזירת מסחר.
hu_hu: Ha nem engedélyezed, az eladók csak azokat a termékeket tudják értékesíteni, amelyeket hozzáadtál a piactérhez.
ja_jp: 許可しない場合、運営者がマーケットプレイスに追加した商品のみ出品者は販売することができます
pl_pl: Jeśli na to nie zezwolisz, sprzedawcy będą mogli sprzedawać tylko produkty, które dodałeś do marketplace.
ru_ru: Если не включать эту настройку, то продавцы смогут продавать только те товары, которые добавите вы.

# SettingsOptions::master_products::allow_buy_default_common_product
source: Buy a default common product
ja_jp: デフォルトの共通商品を購入する
pl_pl: Kup domyślny wspólny produkt
ru_ru: Быстрая покупка одного из предложений

# SettingsTooltips::master_products::allow_buy_default_common_product
source: The "Add to cart" button will appear next to the product (not just its offers) and select the best offer available.
ja_jp: 「カートに入れる追加」ボタンが商品（その提案だけでなく）の横に表示され、利用可能な最も良い提案を選択することができます。
pl_pl: Obok produktu (nie tylko jego oferty) pojawi się przycisk "Dodaj do koszyka" i wybierz najlepszą dostępną ofertę.
ru_ru: Кнопка "Добавить в корзину" появится не только рядом с предложениями, но и с самим товаром. Будет выбрано лучшее предложение.

# Languages::master_products.vendor_products_tab_name
source: Sellers of this product
he_il: מוכרים של המוצר
hu_hu: Ennek a terméknek az eladói
ja_jp: この商品の販売者
pl_pl: Sprzedawcy tego produktu
ru_ru: Предложения от продавцов

# Languages::master_products.vendor_products_filling
source: Sellers of this product
he_il: מוכרים של המוצר
hu_hu: Ennek a terméknek az eladói
ja_jp: この商品の販売者
pl_pl: Sprzedawcy tego produktu
ru_ru: Предложения от продавцов

# Languages::master_products.vendor_products_block_name
source: Sellers of a product
he_il: מוכרים של המוצר
hu_hu: Egy termék eladói
ja_jp: この商品の販売者
pl_pl: Sprzedawcy produktu
ru_ru: Предложения от продавцов

# Languages::master_products.products_that_vendors_can_sell
source: Products that vendors can sell
he_il: מוצרים שהספקים יכולים למכור
hu_hu: Az eladók által eladható termékek
ja_jp: 出品者が販売可能な商品
pl_pl: Produkty, które sprzedawcy mogą sprzedawać
ru_ru: Товары, которые можно продавать

# Languages::master_products.products_being_sold
source: Products being sold
he_il: מוצרים למכירה
hu_hu: Eladott termékek
ja_jp: 販売中の商品
pl_pl: Produkty sprzedawane
ru_ru: Товары в продаже

# Languages::master_products.all_products
source: All products
he_il: כל המוצרים
hu_hu: Minden termék
ja_jp: すべての商品
pl_pl: Wszystkie produkty
ru_ru: Все товары

# Languages::master_products.add_product_from_catalog
source: Add product from catalog
he_il: הוסף מוצרים מהקטלוג
hu_hu: Termék hozzáadása a katalógusból
ja_jp: 販売可能な商品から追加
pl_pl: Dodawanie produktów z katalogu
ru_ru: Добавить товар из каталога

# Languages::master_products.create_new_product
source: Create new product
he_il: צור מוצר חדש
hu_hu: Új termék létrehozása
ja_jp: 商品の追加
pl_pl: Tworzenie nowego produktu
ru_ru: Создать новый товар

# Languages::master_products.sell_this
source: Sell this
he_il: תמכור את זה
hu_hu: Eladni
ja_jp: 販売する
pl_pl: Sprzedawaj ten
ru_ru: Продавать

# Languages::master_products.for_sale
source: For sale
he_il: למכירה
hu_hu: Eladó
ja_jp: 販売中
pl_pl: Na sprzedaż
ru_ru: Продаётся

# Languages::master_products.sell_selected
source: Sell selected
he_il: המכירה נבחרה
hu_hu: Kiválasztottak eladása
ja_jp: 選択したものを販売する
pl_pl: Sprzedawaj wybrane
ru_ru: Продавать выбранные

# Languages::master_products.products_were_added_to_your_products
source: [n] product was added to your products|[n] products were added to your products
he_il: [n] המוצר נוסף למוצרים שלך|[n] מוצרים נוספו למוצרים שלך
hu_hu: [n] termék hozzá lett adva a termékeidhez|[n] termékek hozzá lettek adva a termékeidhez
ja_jp: [n]個の商品が追加されました
pl_pl: [n] produkt został dodany do Twojej bazy produktów | [n] produktów zostało dodanych do Twojej bazy produktów
ru_ru: [n] товар был добавлен в продажу|[n] товара были добавлены в продажу|[n] товаров было добавлено в продажу

# Languages::master_products.master_product
source: Common product
he_il: מוצר משותף
hu_hu: Közös termék
ja_jp: 共通製品
pl_pl: Wspólne produkty
ru_ru: Общий товар

# Languages::master_products.all_vendors_master_product
source: All vendors (common product)
he_il: כל המוכרים (מוצר משותף)
hu_hu: Minden eladó (közös termék)
ja_jp: 全ての出品者（共通商品）
pl_pl: Wszystkich sprzedawców (wspólny produkt)
ru_ru: Все продавцы (общий товар)

# Languages::master_products.exported_products
source: Products to export
he_il: מוצרים לייצוא
hu_hu: Exportálandó termékek
ja_jp: エクスポートする商品
pl_pl: Produkty do eksportu
ru_ru: Экспортируемые товары

# Languages::master_products.price_from
source: From [formatted_price]
he_il: מ [formatted_price]
hu_hu: [formatted_price] -tól
ja_jp: [formatted_price] から
pl_pl: Od ceny [formatted_price]
ru_ru: От [formatted_price]

# Languages::master_products.product_type.offer
source: Vendor offer
he_il: הצעת מוכר
hu_hu: Eladói ajánlat
ja_jp: 出品者オファー
pl_pl: Oferta sprzedawcy
ru_ru: Предложение продавца

# Languages::master_products.upgrade_notification.title
source: Common Products for Vendors: Add-on now works only with global options
he_il: מוצרים משותפים עבור ספקים: תוסף שעובד כעת עם אופציות גלובליות בלבד
hu_hu: Közös termékek az eladók számára: A bővítmény mostantól csak globális opciókkal működik
ja_jp: 出品者向けの共通商品：アドオンはグローバルオプションでのみ機能するようになりました
pl_pl: Wspólne produkty dla sprzedawców: dodatek działa teraz tylko z opcjami globalnymi
ru_ru: Общие товары для продавцов: Теперь модуль работает только с глобальными опциями

# Languages::master_products.upgrade_notification.message
source: <p>For technical reasons, the <b>[master_product_addon]</b> add-on works only with global options now. If any vendor sells a common product, then we have already converted all options from that product into global options during the upgrade.</p>
he_il: <p>מסיבות טכניות <b>[master_product_addon]</b> התוסף עובד כעת רק עם אופציות גלובליות. אם ספק מוכר מוצר משותף, אז כבר המרנו את כל האופציות של המוצר לאופציות גלובליות בעת השדרוג.</p>
hu_hu: <p>Technikai okokból a <b>[master_product_addon]</b> bővítmény mostantól csak globális opciókkal működik. Ha valamelyik eladó közös terméket árul, akkor a frissítés során már az adott termék összes opcióját globális opcióvá alakítottuk át.</p>
ja_jp: <p>技術的な理由により、<b> [master_product_addon] </b>アドオンは現在グローバルオプションでのみ機能します。 いずれかの出品者が共通商品を販売している場合、アップグレード中にその商品のすべてのオプションをグローバルオプションに変換済みです。</p>
pl_pl: <p>Ze względów technicznych dodatek <b>[master_product_addon]</b> działa teraz tylko z opcjami globalnymi. Jeśli jakikolwiek sprzedawca sprzedaje wspólny produkt, to podczas aktualizacji dokonaliśmy już konwersji wszystkich opcji z tego produktu na globalne opcje.</p>
ru_ru: <p>По техническим причинам, модуль <b>[master_product_addon]</b> теперь работает только с глобальными опциями. При обновлении мы уже конвертировали опции в глобальные у тех товаров, которые продаёт хотя бы один продавец.</p>

# Languages::master_products.view_product_offers
source: See all offers
he_il: הצגת כל ההצעות
hu_hu: Az összes ajánlat megtekintése
ja_jp: すべてのオファーを見る
pl_pl: Zobacz wszystkie oferty
ru_ru: Все предложения

# Languages::master_products.product_type.offer_variation
source: Vendor variation offer
he_il: הצעת וריאציה של ספק
hu_hu: Eladói variációs ajánlat
ja_jp: 出品者バリエーションオファー
pl_pl: Oferta wariantów sprzedawcy
ru_ru: Вариация от продавца

# Languages::master_products.resave_after_show_out_of_stock_products_changed
source: You've changed the <b>Show out of stock products</b> setting. Please export <a href="[url]">all your catalog items</a> (use "Export found products" in the gear button) and reimport them. This will ensure that the displayed price of common products will always remain correct until you change the setting again.
he_il: שינית את <b>הצג מוצרים במלאי</b> הגדרה. אנא ייצא <a href="[url]">כל הפריטים בקטלוג שלך</a> (השתמש ב"ייצא מוצרים שנמצאו "בהילוך כפתור) and לייבא אותם מחדש. זה יבטיח שהמחיר המוצג של מוצרים נפוצים תמיד יישאר נכון עד שתשנה שוב את ההגדרה.
hu_hu: Megváltoztattad a <b>Kifogyott termékek megjelenítése</b> beállítást. Kérjük, exportáld <a href="[url]">az összes katalógusterméked</a> (használd a "Fellelt termékek exportálása" lehetőséget a fogaskerék gombon), és importáld őket újra. Így a közös termékek megjelenített ára mindig helyes marad, amíg újra meg nem változtatod a beállítást.
ja_jp: <b>在庫切れ商品を表示</b>する設定を変更しました。<a href=\"[url]\">すべてのカタログアイテム</a>をエクスポートして（歯車ボタンの[見つかった商品をエクスポート]を使用）、再インポートしてください。 これにより、設定を再度変更するまで、共通商品の表示価格が常に正しい状態になります。
pl_pl: Zmieniłeś ustawienie <b>Pokaż niedostępne produkty</b>. Wyeksportuj <a href="[url]"> wszystkie elementy katalogu</a> (użyj przycisku „Eksportuj znalezione produkty” na przycisku koła zębatego) i ponownie je zaimportuj. Spowoduje to, że wyświetlana cena popularnych produktów zawsze będzie poprawna do momentu ponownej zmiany ustawienia.
ru_ru: Вы изменили настройку <b>"Показывать товары, которых нет в наличии"</b>. Экспортируйте <a href="[url]">все позиции в каталоге</a> (воспользуйтесь действием "Экспортировать найденные товары" в меню шестерёнки). Затем импортируйте эти товары. Это нужно, чтобы цена общих товаров отображалась правильно, пока в снова не измените настройку.

# Languages::master_products.save_up_to
source: Save up to
he_il: חסוך עד
hu_hu: Megtakarítása akár ...
ja_jp: 最大保存
pl_pl: Zaoszczędź do
ru_ru: Скидка до

# Languages::master_products.buy_together_info_message_for_admin
source: Only vendors can add product combinations. To add a combination for a common product, first log in as one of the vendors that sell it.
hu_hu: Csak a termelők adhatnak hozzá termékkombinációkat. Ha közös termékhez kombinációt szeretnél hozzáadni, először jelentkezz be az adott terméket értékesítő termelő egyikeként.
ja_jp: 商品の組み合わせを追加できるのは、出品者のみです。一般的な商品の組み合わせを追加するには、まずその商品を販売している出品者の1人としてログインしてください。
pl_pl: Tylko sprzedawcy mogą dodawać kombinacje produktów. Aby dodać kombinację dla wspólnego produktu, najpierw zaloguj się jako jeden ze sprzedawców, który go sprzedaje.
ru_ru: Только продавцы могут добавлять комбинации товаров. Чтобы добавить комбинацию, сначала войдите как один из продавцов, которые продают товар.

# Languages::master_products.buy_together_info_message_for_vendor
source: To add a combination for a common product, <a class="cm-post" href="[href]">start selling it</a> first.
hu_hu: Ahhoz, hogy közös termékhez egy kombinációt adj hozzá, először <a class="cm-post" href="[href]">kezdd el árulni</a>.
ja_jp: 共通商品の組み合わせを追加するには、まず<a class="cm-post" href="[href]">その商品の販売を開始してください</a>。
pl_pl: Aby dodać kombinację dla wspólnego produktu, <a class="cm-post" href="[href]">zacznij go sprzedawać</a>.
ru_ru: Чтобы добавить комбинацию для общего товара, сначала <a class="cm-post" href="[href]">начните его продавать</a>.

# Languages::master_products.changing_owner_is_not_available
source: Couldn't change the owner of the product because some vendors still sell it. Please delete <a href="[vendors_offers_link]" target="_blank">vendors' offers</a> before changing the owner of this product.
ja_jp: 一部の出品者がまだ販売をしているため、商品の管理者を変更できませんでした。この商品の管理者を変更する前に<a href=\"[vendors_offers_link]\" target=\"_blank\">出品者の申込み</a>を削除してください。
pl_pl: Nie udało się zmienić właściciela produktu, ponieważ niektórzy sprzedawcy nadal go sprzedają. Usuń <a href="[vendors_offers_link]" target="_blank">oferty sprzedawców</a> przed zmianą właściciela tego produktu.
ru_ru: Не удалось изменить владельца товара: некоторые продавцы всё ещё продают товар. Чтобы изменить владельца товара, сначала удалите <a href="[vendors_offers_link]" target="_blank">предложения от продавцов</a>.

# Languages::master_products.product_bundles_info
source: Only vendors can add product bundles. To add a bundle for a common product, first log in as one of the vendors that sell it.
ja_jp: 商品バンドルは、出品者だけが追加できます。共通商品のバンドルを追加するには、まずその商品を販売している出品者の1社としてログインします。
pl_pl: Tylko sprzedawcy mogą dodawać pakiety produktów. Aby dodać pakiet dla wspólnego produktu, najpierw zaloguj się jako jeden ze sprzedawców, którzy go sprzedają.
ru_ru: Только продавцы могут добавлять комплекты товаров. Чтобы добавить комплект, сначала войдите как один из продавцов, которые продают товар.

# Languages::master_products.best_price
source: [formatted_price] (<a class="[link_class]" data-ca-scroll="[data_scroll]" [other_offers_link]>and other offers</a>)
pl_pl: [formatted_price] (<a class="[link_class]" data-ca-scroll="[data_scroll]" [other_offers_link]>i inne oferty</a>)
ru_ru: [formatted_price] (<a class="[link_class]" data-ca-scroll="[data_scroll]" [other_offers_link]>и другие предложения</a>)

source: "Common products for vendors" are now easier to buy
ja_jp: 「出品者向け共通商品」が買いやすくなりました
pl_pl: "Wspólne produkty dla sprzedawców" są teraz łatwiejsze do kupienia
ru_ru: "Общие товары для продавцов" теперь проще купить

source: Previously, customers had to open the product page and choose one of the offers from vendors. Now they'll be able to add a common product to cart much like a normal product: from the product list, or on the product page without scrolling down to offers. By default, CS-Cart Multi-Vendor will choose the best offer based on the price and availability. If you use the "Vendor rating" add-on, its settings allow you to pick a product based on the rating rather than price.<br><br>To allow this, go to the settings of the "Common products for vendors" add-on and enable the "Buy a default common product" setting.<br><br><a target="_blank" href="[settings_url]" class="btn">Go to settings</a>
ja_jp: 以前は、お客様は商品ページを開いて出品者からの提案の1つを選択する必要がありました。今では、通常の商品と同じように商品一覧から、または商品ページで提案までスクロールせずに、共通商品をカートに追加できるようになりました。デフォルトでは、CS-Cart Multi-Vendorは、価格と在庫状況に基づいて最適な提案を選択します。 「出品者評価」アドオンを使用する場合、設定により価格ではなく評価に基づいて商品を選択できます。<br><br>これを許可するには、「出品者向けの共通商品 」アドオンの設定に移動します。アドオンを追加して、[デフォルトの共通商品を購入する」設定を有効にします。<br> <br> <atarget = "_ blank" href = "[settings_url]" class = "btn">設定に移動</a>
pl_pl: Wcześniej klienci musieli otworzyć stronę produktu i wybrać jedną z ofert sprzedawców. Teraz będą mogli dodać wspólny produkt do koszyka, podobnie jak zwykły produkt: z listy produktów lub na stronie produktu bez przewijania w dół do ofert. Domyślnie CS-Cart Multi-Vendor wybierze najlepszą ofertę na podstawie ceny i dostępności. Jeśli korzystasz z dodatku "Ocena sprzedawcy", jego ustawienia pozwalają wybrać produkt na podstawie oceny, a nie ceny.<br><br>Aby to umożliwić, przejdź do ustawień dodatku "Wspólne produkty dla sprzedawców" i włącz ustawienie "Kup domyślny wspólny produkt".<br><br><a target="_blank" href="[settings_url]" class="btn">Przejdź do ustawień</a>
ru_ru: Раньше покупателям нужно было открыть страницу товара и выбрать одно из предложений от продавцов. Теперь они смогут добавить общий товар в корзину как обычный товар: со списка товаров или со страницы товаров, без необходимости просматривать предложения. По умолчанию CS-Cart Muti-Vendor выберет лучшее предложение, исходя из цены и доступности. Если вы используете модуль "Рейтинг продавцов", то его настройки позволят выбирать товар не по цене, а по рейтингу.<br><br>Чтобы разрешить покупку общего товара, перейдите в настройки модуля "Общие товары для продавцов" и включите настройку "Быстрая покупка одного из предложений".<br><br><a target="_blank" href="[settings_url]" class="btn">Перейти в настройки</a>

# Languages::master_products.include_offers_from_multiple_sellers
source: To add the required number of items to cart, we had to include offers from multiple sellers. Some of them may come at different prices.
ja_jp: 必要な数の商品をカートに入れるには、複数の出品者からの提案を入れる必要がありました。その中には、異なる価格で提供されるものもあります。
pl_pl: Aby dodać wymaganą liczbę produktów do koszyka, musieliśmy uwzględnić oferty od wielu sprzedawców. Niektóre z nich mogą mieć różne ceny.
ru_ru: Чтобы добавить нужное количество товара в корзину, нам пришлось включить предложения от нескольких продавцов. Предложения могут отличаться по цене.
