Repository: muh-dirga-f/multivendor_cscart
Catalog: var/langs/*/addons/vendor_debt_payout.po
Languages: uk_ua

# Addons::name::vendor_debt_payout
source: Vendor-to-admin payments
uk_ua: Оплата від продавців адміністратору

# Addons::description::vendor_debt_payout
source: Restricts the functionality of vendors' admin panels under certain conditions and enables your vendors to pay their fees and debts from their admin panel dashboards. It is as easy as purchasing a product from the storefront.
uk_ua: Обмежує функціональність панелей адміністрування продавців при певних умовах; дозволяє продавцям оплачувати підписку і платити борги безпосередньо з панелей адміністраторів. Процес оплати боргів не складніше покупки товару на вітрині.

# SettingsOptions::vendor_debt_payout::default_lowers_allowed_balance
source: Suspend vendors if their balance remains below
uk_ua: Призупиняти облікові записи продавців, якщо їх баланс залишається нижче

# SettingsOptions::vendor_debt_payout::default_grace_period_to_refill_balance
source: Grace period to refill balance
uk_ua: Час на поповнення балансу

# SettingsOptions::vendor_debt_payout::vendor_taxes
source: Taxes on refilling balance
uk_ua: Податок на поповнення балансу

# Languages::vendor_debt_payout
source: Vendor-to-admin payments
uk_ua: Оплата від продавців адміністратору

# Languages::vendor_debt_payout.debt_payout
source: Marketplace fees
uk_ua: Оплата заборгованості

# Languages::vendor_debt_payout.debt_payout_w_order
source: Marketplace fees (order #[id])
uk_ua: Оплата заборгованості (замовлення#[id])

# Languages::vendor_debt_payout.payment_surcharge_w_order
source: Payment surcharge for marketplace fees (order #[id])
uk_ua: Додаткова оплата комісії на marketplace (замовлення #[id])

# Languages::vendor_debt_payout.pay_fees
source: Pay the fees
uk_ua: Оплатити заборгованість

# Languages::vendor_debt_payout.vendor_debt_limit
source: Restrict admin panel functions if vendor's debt reaches
uk_ua: Обмежити функціональність панелі адміністратора, якщо борг продавця досягає

# Languages::ttc_vendor_debt_payout.vendor_debt_limit
source: When a vendor's balance is negative and reaches this number, the vendor's administration panel will not allow to perform any actions. When a vendor's negative balance is half this number, the vendor will see the warning specified in the "vendor_debt_payout.debt_near_limit_message" language variable.
uk_ua: Коли негативний баланс продавця досягає цієї суми, панель адміністрування продавця не дозволить нічого зробити. Якщо борг продавця дорівнює половині цієї суми, то продавець побачить попередження; його текст береться з мовної змінної "vendor_debt_payout.debt_near_limit_message".

# Languages::vendor_debt_payout.payout_overdue_limit
source: Grace period for vendor plan fees
uk_ua: Відтермінування для оплати тарифного плану

# Languages::ttc_vendor_debt_payout.payout_overdue_limit
source: Payments for plans are drawn from the vendor's account balance. If the balance gets negative after the fee is taken, and this period expires, the vendor's administration panel will not allow to perform any actions until the vendor pays the debt.
uk_ua: Оплата за тарифний план списується з балансу продавця. Якщо баланс став негативним після списання оплати, а цей період закінчився, то панель адміністратора продавця не дозволить виконувати ніякі дії, поки продавець не сплатить заборгованість.

# Languages::vendor_debt_payout.day_or_days
source: day(s)
uk_ua: дн.

# Languages::vendor_debt_payout.pending_payout_message
source: You need to pay the fee of [fee_amount] for using the [plan_name] plan. Your current account balance is [current_balance]. If the fee isn't paid until [overdue_date], you won't be able to work with the administration panel until you <a href="[pay_url]" target="_blank">pay all your marketplace fees</a>.
uk_ua: Необхідно сплатити суму [fee_amount] за використання тарифного плану [plan_name]. Ваш поточний баланс становить [current_balance]. Якщо сума не буде сплачена до [overdue_date], ви не зможете працювати з панеллю адміністратора, поки не <a href="[pay_url]" target="_blank">сплатите заборгованість</a>.

# Languages::vendor_debt_payout.debt_near_limit_message
source: Your account balance is currently [current_balance]. If it reaches [minimal_balance], you won't be able to use your administration panel until you <a href="[pay_url]" target="_blank">pay all your marketplace fees</a>.
uk_ua: Ваш поточний баланс становить [current_balance]. Якщо він досягне [minimal_balance], ви не зможете користуватися панеллю адміністратора, поки не <a href="[pay_url]" target="_blank">сплатите заборгованість</a>.

# Languages::vendor_debt_payout.block_alert
source: <p>Your access to the administration panel has been restricted automatically because you have reached the limit of negative account balance or haven't paid a fee for your vendor plan in time.</p><p>Your current account balance is [current_balance].</p><p>Please <a href="[pay_url]">pay the marketplace fees</a> — once the payment is processed, your access to the administration panel will be restored automatically.</p>
uk_ua: <p>Ваш доступ до панелі адміністратора було автоматично обмежено, тому що ви досягли ліміту негативного балансу або не сплатили свій тарифний план вчасно.</p> <p>Ваш поточний баланс становить [current_balance].</p> <p> <a href="[pay_url]">Сплатіть заборгованість</a> - після обробки платежу ваш доступ до панелі адміністратора відновиться автоматично</p>

# Languages::vendor_debt_payout.suspend_vendors
source: Suspend vendors
uk_ua: Призупинити продавців

# Languages::vendor_debt_payout.lowest_allowed_balance
source: Suspend vendors if their balance remains below
uk_ua: Призупиняти облікові записи продавців, якщо їх баланс залишається нижче

# Languages::vendor_debt_payout.grace_period_to_refill_balance
source: Grace period to refill balance
uk_ua: Час на поповнення балансу

# Languages::vendor_debt_payout.vendor_status_changed.reason
source: The debt of [amount] that hasn't been paid until [date].
uk_ua: Борг розміром [amount] не було сплачено до [date].

# Languages::vendor_debt_payout.lowest_allowed_balance_info_text
source: To make working with suspended vendors easier, please check the settings of the <a href="[link]">Vendor-to-admin payments</a> add-on.
uk_ua: Щоб спростити роботу з призупиненими продавцями, перевірте налаштування доповнення <a href="[link]">Платежі від продавця до адміністратора</a>.

# Languages::vendor_debt_payout.vendor_plan_debt_info_text
source: A vendor can get suspended if the debt exceeds the conditions of the <a href="[link]">vendor plan</a>.
uk_ua: Обліковий запис продавця може бути призупинено, якщо борг вендора перевищить умови <a href="[link]">тарифного плану</a>.

# Languages::vendor_debt_payout.hide_products
source: Hide products of suspended vendors
uk_ua: Приховувати товари призупинених продавців

# Languages::vendor_debt_payout.block_admin_panel
source: Block admin panel of suspended vendors
uk_ua: Блокувати панель адміністратора призупинених продавців

# SettingsOptions::vendor_debt_payout::block_admin_panel
source: Block admin panel of suspended vendors
uk_ua: Блокувати панель адміністратора призупинених продавців

# Languages::vendor_debt_payout.vendor_notifications
source: Notify vendors about upcoming suspension
uk_ua: Повідомляти продавцям про майбутнє призупинення

# Languages::vendor_debt_payout.admin_notifications
source: Notify admin about suspended vendors
uk_ua: Повідомити адміністратора про призупинених продавців

# Languages::vendor_debt_payout.edit_notifications_link
source: <a target = "_blank" href = "[link]">Edit notifications</a>
uk_ua: <a target = "_blank" href = "[link]">Редагувати сповіщення</a>

# Languages::vendor_debt_payout.admin_notifications_weekly
source: Send weekly digest of suspended vendors
uk_ua: Надсилати щотижневий дайджест призупинених продавців

# Languages::vendor_debt_payout.disable_suspended_vendors
source: Disable suspended vendors after a while
uk_ua: Заблокувати призупинених продавців через деякий час

# Languages::vendor_debt_payout.days_before_disable
source: Time in days before a suspended vendor is disabled
uk_ua: Час у днях до блокування призупиненого продавця

# Languages::vendor_debt_payout.vendor_notifications_about_disable
source: Notify vendors about their disabled account
uk_ua: Повідомити продавців про їх заблокований обліковий запис

# Languages::vendor_debt_payout.admin_notifications_about_disable
source: Notify admin about disabled vendors
uk_ua: Повідомити адміністратора про відключених продавців

# Languages::vendor_debt_payout.actions_on_suspended
source: Actions on suspended vendors
uk_ua: Дії над призупиненими продавцями

# Languages::vendor_debt_payout.notifications
source: Notifications
uk_ua: Сповіщення

# Languages::vendor_debt_payout.refill_balance
source: Refill balance
uk_ua: Поповнити баланс

# Languages::vendor_debt_payout.enter_an_amount
source: Enter an amount
uk_ua: Введіть суму

# Languages::vendor_debt_payout.error_refill_amount_lower_than_zero
source: Sorry, couldn't proceed to payment. The specified sum must be greater than 0.
uk_ua: На жаль, не вдалося продовжити оплату. Вказана сума має бути більшою за 0.

# Languages::vendor_debt_payout.suspend_debt_notification
source: Your account is suspended. To lift the suspension, please deposit at least [amount] to refill the balance up to [vendor_plan_lowers_allowed_balance]. <a target="_blank" href="[link]">Refill balance</a>.
uk_ua: Ваш обліковий запис призупинено. Щоб скасувати призупинення, будь ласка, внесіть депозит у розмірі щонайменше [amount], щоб поповнити баланс до [vendor_plan_lowers_allowed_balance]. <a target="_blank" href="[link]">Поповніть баланс</a>.

# Languages::vendor_debt_payout.warning_debt_notification
source: Your account might get suspended soon. Please deposit at least [amount] until [date] to avoid suspension. <a target="_blank" href="[link]">Refill balance</a>.
uk_ua: Незабаром ваш обліковий запис може бути призупинено. Щоб уникнути призупинення, внесіть депозит принаймні на [amount] до [date]. <a target="_blank" href="[link]">Поповнити баланс</a>.

# Languages::vendor_debt_payout.suspend_debt_alert
source: <p>Your account has been suspended automatically.</p><p>Reason: your current balance is [balance], which is below the minimum allowed balance of [lowers_allowed_balance].</p><p>Please deposit at least [amount]. Once the payment is processed, the suspension will be lifted automatically.</p>
uk_ua: <p>Ваш обліковий запис було автоматично призупинено.</p><p>Причина: ваш поточний баланс становить [balance], який є нижче за мінімально дозволений баланс [lowers_allowed_balance].</p><p>Внесіть принаймні [amount]. Після обробки платежу призупинення буде автоматично скасовано.</p>

# Languages::vendor_debt_payout.warning_debt_alert
source: <p>Your current balance is [balance], which is below the minimum allowed balance of [lowers_allowed_balance].</p><p>Please deposit at least [amount] until [date]. Otherwise your account might get suspended.
uk_ua: <p>Ваш поточний баланс становить [balance], який є нижче за мінімально доступний баланс [lowers_allowed_balance].</p><p>Внесіть принаймні [amount] до [date]. В іншому випадку, ваш обліковий запис може бути призупинено.

# Languages::vendor_debt_payout.dashboard_suspended_vendors
source: Suspended vendors
uk_ua: Призупинені продавці

# Languages::vendor_debt_payout.negative_balance_reached.subject
source: Your account might get suspended soon
uk_ua: Ваш обліковий запис скоро може бути призупинено

# Languages::vendor_debt_payout.suspended_status_reached.subject
source: Your account is suspended
uk_ua: Ваш обліковий запис призупинено.

# Languages::vendor_debt_payout.event.negative_balance_reached.name
source: Vendor sign-in: Debt and grace period
uk_ua: Вхід продавця: борг і пільговий період

# Languages::vendor_debt_payout.negative_balance_reached.message
source: Please deposit at least [amount] until [date] to avoid suspension.
uk_ua: Щоб уникнути призупинення, внесіть депозит принаймні на [amount] до [date].

# Languages::vendor_debt_payout.suspended_status_reached.message
source: To lift the suspension, please deposit at least [amount] to refill the balance up to [vendor_plan_lowers_allowed_balance].
uk_ua: Щоб скасувати призупинення, внесіть депозит принаймні на [amount], щоб поповнити баланс до [vendor_plan_lowers_allowed_balance].

# Languages::email_template.vendor_debt_payout_vendor_days_before_suspended
source: Vendor-to-admin payments notifications
uk_ua: Повідомлення про платежі від продавця до адміністратора

source: Vendor-to-admin payments notifications
uk_ua: Повідомлення про платежі від постачальника до адміністратора

# Languages::internal_template.vendor_debt_payout_vendor_days_before_suspended
source: Vendor-to-admin payments notifications
uk_ua: Повідомлення про платежі від постачальника до адміністратора

source: Vendor-to-admin payments notifications
uk_ua: Повідомлення про платежі від постачальника до адміністратора

# Languages::vendor_debt_payout.event.vendor_status_changed_to_suspended.name
source: Vendor status was changed to Suspended
uk_ua: Статус продавця змінено на "Призупинено"

source: Vendor-to-admin payments notifications
uk_ua: Повідомлення про платежі від постачальника до адміністратора

# Languages::email_template.company_status_changed_from_suspended_notification
source: Vendor status changed from Suspended
uk_ua: Продавець вийшов зі статусу "Призупинено"

# Languages::internal_template.vendor_debt_payout_negative_balance_reached
source: Vendor sign-in: Debt and grace period
uk_ua: Вхід продавця: борг і пільговий період

source: Vendor-to-admin payments notifications
uk_ua: Повідомлення про платежі від продавця до адміністратора

# Languages::vendor_debt_payout.event.vendor_status_changed_to_disabled.name
source: Vendor status was changed to Disabled
uk_ua: Статус продавця змінено на "Заблоковано"

# Languages::vendor_debt_payout.weekly_digest_of_debtors.subject
source: [marketplace_name]: Weekly digest of debtors
uk_ua: [Marketplace_name]: Щотижневий звіт про боржників

# Languages::vendor_debt_payout.weekly_digest_of_debtors.message
source: This is a weekly report on debtors in your marketplace. It includes the vendors who have become debtors or paid their debt since the last report. Your marketplace might have <a href="[href]">more suspended vendors</a>.
uk_ua: Це щотижневий звіт про боржників на вашому marketplace. Включає продавців, які стали боржниками або сплатили свій борг з моменту останнього звіту. На вашому marketplace може бути <a href="[href]">більше призупинених продавців</a>.

# Languages::vendor_debt_payout.event.weekly_digest_of_debtors.name
source: Weekly digest of debtors
uk_ua: Щотижневий дайджест про боржників

# Languages::email_template.vendor_debt_payout_weekly_digest_of_debtors
source: Weekly digest of debtors
uk_ua: Щотижневий дайджест про боржників

# Languages::vendor_debt_payout.vendor_status_changed.subject
source: [vendor_name]: Status changed to [status]
uk_ua: [vendor_name]: Статус змінено на [status]

# Languages::vendor_debt_payout.vendor_status_changed.message
source: The status of vendor [vendor_name] was changed to [status].
uk_ua: Статус продавця [vendor_name] змінено на [status].

# Languages::vendor_debt_payout.vendor_days_before_suspend.subject
source: Your account might get suspended soon
uk_ua: Незабаром ваш обліковий запис може бути призупинено

# Languages::vendor_debt_payout.vendor_days_before_suspend.message
source: Your account at [marketplace] might get suspended soon.
uk_ua: Ваш обліковий запис на [marketplace] може бути незабаром призупинено.

# Languages::vendor_debt_payout.event.vendor_days_before_suspend.name
source: Info about upcoming suspension
uk_ua: Інформація про майбутнє призупинення

# Languages::vendor_debt_payout.reason_block
source: Your current balance is [balance], which is below the minimum allowed balance of [lowers_allowed_balance]. Please deposit at least [amount] until [date] to avoid suspension. You can refill the balance in your <a href="[link]">vendor panel</a>.
uk_ua: Ваш поточний баланс становить [balance], який є нижче за мінімально доступний баланс [lowers_allowed_balance]. Будь ласка, внесіть принаймні [amount] до [date], щоб уникнути призупинення. Ви можете поповнити баланс у своїй <a href="[link]">панелі продавця</a>.

# Languages::vendor_debt_payout.old_addon_name
source: Vendor debt payout
uk_ua: Виплата боргів продавців

# Languages::vendor_debt_payout.rework_update_notification.title
source: Vendor debt management reworked. Check your add-on settings.
uk_ua: Змінено управління боргом продавця. Перевірте налаштування додатків.

# Languages::vendor_debt_payout.rework_update_notification.message
source: <p>We have reworked the <b>[vendor_debt_payout_old_addon_name]</b> add-on. It is now called <b>[vendor_debt_payout_addon]</b>, and it can do more than before. Here are the changes to look out for:</p><p>The maximum debt and grace period can now be specified on the vendor plan level, if you allow it in the add-on settings.</p><p>The maximum debt and the grace period now work in conjunction. A vendor reaches maximum debt, and then has to pay it within the grace period.</p><p>The add-on settings allow you to decide what to do with debtors: block their admin panel and/or hide their products from the storefront.</p><p><a href="[vendor_debt_payout_href]" target="_blank" class="btn btn-large btn-primary">View add-on settings</a></p>
uk_ua: <p>Ми переробили доповнення <b>[vendor_debt_payout_old_addon_name]</b>. Тепер він називається <b>[vendor_debt_payout_addon]</b>, і він може робити більше, а ніж раніше. Ось зміни, на які слід звернути увагу:</p><p> Максимальний борг і пільговий період тепер можна вказати на рівень плану продавця, якщо ви дозволите це в налаштуванні додатку.</p><p>Тепер максимальний борг та пільговий період працюють разом. Продавець досягає максимального боргу, а потім має сплатити його протягом пільгового періоду.</p><p>Налаштування доповнень дозволяють вам вирішувати, що робити з боржниками: блокувати їх панель адміністратора та/або приховати свої товари у вітрині магазину.</p><p><a href="[vendor_debt_payout_href]" target="_blank" class="btn btn-large btn-primary">Переглянути налаштування доповнень</a></p>

# Languages::vendor_debt_payout.update_notification.title
source: Vendor debt is now handled differently. Decide how you want to handle it.
uk_ua: Заборгованість продавця тепер обробляється по-іншому. Вирішіть, як ви хочете впоратися з цим.

# Languages::vendor_debt_payout.update_notification.message
source: <p>Before the upgrade, a vendor's admin panel could get blocked even when the vendor didn't reach maximum debt. That happened when 3 conditions came together: it was time to pay for the plan; the vendor's balance couldn't cover it; the vendor didn't pay in time. <b>But now a vendor doesn't get blocked before going below the minimum allowed balance</b>.</p><p>That's why we ask you to:</p><ol><li>Decide how you'd like your marketplace to work. Configure the Vendor Plans add-on accordingly. There are 2 scenarios:<ul><li>A vendor's balance can go negative to a certain point. Once it does, the vendor has some time to pay the debts before repercussions happen. <b>This is how your marketplace works now</b>. If you like it this way, then just take a look at the Vendor Plans add-on and its configuration.</li><li>No vendor debt is allowed. Whenever a vendor's balance can't cover the plan's fee without going negative, the vendor will have to pay the debt within the specified time. <b>For this scenario, the minimum allowed balance must be 0</b>. If that's what you want, just click the corresponding button below, and we'll configure everything for you. You don't have to decide right now — you'll always be able to adjust it later.</li></ul></li><li>Some vendors might have been blocked by the old <b>[vendor_debt_payout_old_addon_name]</b>, but wouldn't be blocked with the current configuration of <b>[vendor_debt_payout_addon]</b>. Click the button below to see if you have any such vendors. If you do, you can give them the "Suspended" status to restrict their access to the admin panel. But it's best to decide on one of the scenarios above, configure the Vendor Plans add-on, and let the problem solve itself automatically.</li></ol><p><a href="[unblocked_vendors_href]" target="_blank" class="btn btn-large btn-primary">See if any vendors got unblocked</a> <a href="[drop_lowers_allowed_balance_of_vendor_plans_href]" class="btn btn-large" style="margin-left: 35px;">Don't allow any negative balance</a></p>
uk_ua: <p>До оновлення, у продавця могла бути заблокована панель адміністратора, навіть якщо продавець не досяг максимальної заборгованості. Це сталося, коли збіглися 3 умови: настав час платити за план; баланс продавця не міг покрити його; продавець не розрахувався вчасно. <b>Але тепер продавцю не заборонено перевищувати мінімально дозволений баланс</b>.</p><p>Тому ми просимо вас:</p><ol><li>Вирішити, як ви хочете, щоб ваш marketplace працював. Відповідним чином налаштуйте додаток "Плани продавця". Є 2 сценарії:<ul><li>Баланс продавця може стати від'ємним до певної міри. Коли це відбувається, у продавця є час, щоб сплатити свої борги, перш ніж настануть наслідки. <b>Ось як тепер працює ваш marketplace</b>. Якщо вам це не подобається, просто перегляньте додаток "Плани продавця" та його конфігурацію.</li><li>Заборгованість від продавця не допускається. Якщо баланс продавця не може покрити плату за планом без негативного результату, продавець повинен буде погасити борг протягом певного періоду часу. <b>У цьому випадку, мінімально дозволений баланс має бути 0</b>. Якщо це те, що ви хочете, просто натисніть відповідну кнопку нижче, і ми налаштуємо все за вас. Вам не потрібно приймати рішення прямо зараз — ви завжди зможете змінити це пізніше.</li></ul></li><li>Деякі продавці, можливо, були заблоковані старим <b>[vendor_debt_payout_old_addon_name]</b>, але він не буде заблокований у поточній конфігурації <b>[vendor_debt_payout_addon]</b>. Натисніть кнопку нижче, щоб побачити, чи є у вас такі продавці. Якщо ви це зробите, ви можете встановити для них статус "Призупинено", щоб обмежити їхній доступ до панелі адміністратора. Але найкраще вибрати один із наведених вище сценаріїв, налаштувати доповнення "Плани продавця" і дати вирішити проблему самостійно.</li></ol><p><a href="[unblocked_vendors_href]" target="_blank" class="btn btn-large btn-primary">Подивіться, чи були розблоковані продавці</a> <a href="[drop_lowers_allowed_balance_of_vendor_plans_href]" class="btn btn-large" style="margin-left: 35px;">Не допускати від'ємного балансу</a></p>

# Languages::vendor_debt_payout.minimum_allowed_balance_to_zero
source: We've set the minimum allowed balance to 0. Now whenever a vendor's balance goes below 0, the grace period will start, and the vendor will be asked to pay the debt.
uk_ua: Ми встановили мінімально доступний баланс на 0. Тепер, коли баланс постачальника опускається нижче 0, почнеться пільговий період, і продавцю буде запропоновано сплатити борг.

# Languages::vendor_debt_payout.admin_weekly_digest_of_suspended_vendors
source: Send weekly digest of suspended vendors
uk_ua: Надсилати щотижневий дайджест припинених продавців

# Languages::vendor_debt_payout.debt_owned
source: Debt owned
uk_ua: Розмір боргу

# Languages::vendor_debt_payout.account_balance
source: Account balance
uk_ua: Баланс облікового запису

# Languages::vendor_debt_payout.list_of_vendors_got_suspended_label
source: These vendors got suspended for debt automatically since the last report::
uk_ua: Ці продавці були автоматично призупинені через борги з моменту останнього звіту:
