Repository: muh-dirga-f/multivendor_cscart
Catalog: var/langs/*/addons/vendor_debt_payout.po
Languages: uk_ua

# Languages::vendor_debt_payout.list_of_vendors_got_suspended_and_paid_label
source: These vendors paid their debt and had their suspension lifted since the last report:
uk_ua: Ці продавці сплатили свій борг і їх призупинили з моменту останнього звіту:

# Languages::vendor_debt_payout.empty_list_of_vendors_got_suspended_label
source: No vendors got suspended for debt automatically since the last report.
uk_ua: З моменту останнього звіту жодного продавця не було автоматично призупинено за борги.

# Languages::vendor_debt_payout.empty_list_of_vendors_got_suspended_and_paid_label
source: No vendors paid their debt and had their suspension lifted since the last report.
uk_ua: З моменту останнього звіту жодний продавець не сплатив свій борг і їх не призупинили.

# Languages::vendor_debt_payout.total_debts
source: The total debt of all vendors in your marketplace (including those not listed in this report) is currently [total_debt].
uk_ua: Загальна заборгованість усіх продавців на вашому marketplace (включно з тими, які не перелічені в цьому звіті) наразі становить [total_debt].

# Languages::vendor_debt_payout.catalog_items.help
source: Vendors repay their debt by purchasing specific marketplace fees product. Here you can edit details of the product and the category it belongs to.
uk_ua: Продавці погашають свої борги, купуючи конкретний товар на marketplace. Тут ви можете редагувати деталі товару та категорії, до якої він належить.

# Languages::vendor_debt_payout.product
source: Product
uk_ua: Товар

# Languages::vendor_debt_payout.category
source: Category
uk_ua: Категорія

# Languages::vendor_debt_payout.edit_description
source: <a href="[link]" target="_blank">Edit</a>
uk_ua: <a href="[link]" target="_blank">Редагувати</a>
